<?php
date_default_timezone_set('Asia/Shanghai');

//$id = isset($_GET['id'])?$_GET['id']:'cctv1';
$id='hnjs';
$n = [
    //央视
    'cctv1' => [4403,1,2300], //CCTV1综合
    'cctv2' => [4403,2,2300], //CCTV2财经
    'cctv3' => [4403,3,2300], //CCTV3综艺
    'cctv3b' => [4403,41139,1300], //CCTV3综艺2
    'cctv4' => [4403,4,2300], //CCTV4中文国际
    'cctv5' => [4403,5,2300], //CCTV5体育
    'cctv5b' => [1301,41140,2300], //CCTV5体育2
    'cctv5p' => [4403,13,2300], //CCTV5+体育赛事
    'cctv6' => [4403,6,2300], //CCTV6电影
    'cctv6b' => [1301,41141,2300], //CCTV6电影2
    'cctv7' => [4403,7,2300], //CCTV7国防军事
    'cctv8' => [4403,8,2300], //CCTV8电视剧
    'cctv8b' => [1301,41142,2300], //CCTV8电视剧2
    'cctv9' => [4403,9,2300], //CCTV9纪录
    'cctv10' => [4403,10,2300], //CCTV10科教
    'cctv11' => [4403,41,2300], //CCTV11戏曲
    'cctv12' => [4403,11,2300], //CCTV12社会与法
    'cctv13' => [4403,39,2300], //CCTV13新闻
    'cctv14' => [4403,12.2300], //CCTV14少儿
    'cctv15' => [4403,40,2300], //CCTV15音乐
    'cctv16' => [1301,116,2300], //CCTV16奥林匹克
    'cctv17' => [4309,90,2300], //CCTV17农业农村
    //'sh' => [1301,11009,2300], //书画频道
    //'yggw' => [1301,11011,2300], //央广购物
    'zgtq' => [1301,11006,2300], //中国天气
    'cgtn' => [4309,15,2300], //CGTN
    'cgtnjl' => [4403,14,2300], //CGTN纪录
    'gqdy' => [4309,43063,2300],//CHC高清电影
    //中教
    'cetv1' => [4403,33,2300], //CETV1中教1台
    'cetv4' => [4403,38.1300], //CETV4中教4台
    //卫视
    'bjws' => [4403,24,2300], //北京卫视
    'bjws2' => [1301,30,2300], //北京卫视2
    'bjws3' => [4403,37001,2300], //北京卫视3
    'dfws' => [4403,26,2300], //东方卫视
    'tjws' => [4403,28,2300], //天津卫视
    'cqws' => [4403,56,2300], //重庆卫视
    'hljws' => [4403,27,2300], //黑龙江卫视
    'jlws' => [1301,20,1300], //吉林卫视
    'lnws' => [4403,32,2300], //辽宁卫视
    'nmws' => [1301,93,2300], //内蒙古卫视
    'nxws' => [1303,69,2300], //宁夏卫视
    'gsws' => [1301,57,2300], //甘肃卫视
    'qhws' => [1301,60,2300], //青海卫视
    'sxws' => [1301,55,2300], //陕西卫视
    'hbws' => [4403,79,2300], //河北卫视
    'sxiws' => [4403,54,2300], //山西卫视
    'sdws' => [4403,29,2300], //山东卫视
    'ahws' => [4403,23,2300], //安徽卫视
    'hnws' => [4403,78,1300], //河南卫视
    'hubws' => [4403,21,2300], //湖北卫视
    'hunws' => [4403,25,2300], //湖南卫视
    'jxws' => [1301,22,2300], //江西卫视
    'jsws' => [4403,18,2300], //江苏卫视
    'zjws' => [4403,19,2300], //浙江卫视
    'dnws' => [4403,80,2300], //东南卫视
    'gdws' => [1301,16,2300], //广东卫视
    'szws' => [4403,17,2300], //深圳卫视
    'dwqws' => [4403,58,1300], //大湾区卫视
    'gxws' => [1301,59,2300], //广西卫视
    'ynws' => [1301,61,1300], //云南卫视
    'gzws' => [1301,30,2300], //贵州卫视
    'scws' => [4403,31,2300], //四川卫视
    'xjws' => [4309,64,2300], //新疆卫视
    'btws' => [4309,67,2300], //兵团卫视
    'xzws' => [4309,66,2300], //西藏卫视
    'hinws' => [1301,62,2300], //海南卫视
    //北京
    'bjjskj' =>  [1301,11001,2300], //北京纪实科教
    'bjjskj2' =>  [1301,22030,2300], //北京纪实科教2
    //'bjkk' =>  [1301,11003,2300], //卡酷少儿
    'cmpd' =>  [1301,11004,2300], //车迷频道
    'hqly' =>  [1301,11005,2300],  //环球旅游
    'yybb' =>  [1301,11007,2300], //优优宝贝
    'shdy' =>  [1301,43036,2300], //四海钓鱼
    'jshqjx' =>  [1301,11008,2300], //聚鲨环球精选
    'jshqjx2' =>  [1301,32010,2300], //聚鲨环球精选2
    'zqfw' =>  [1301,62001,2300], //证券服务
    //上海
    'dfcj' =>  [1301,41135,2300], //东方财经
    'dfcj2' =>  [4309,43044,2300], //东方财经2
    'hxjc' =>  [4309,43039,2300], //欢笑剧场
    'ly' =>  [4309,43040,2300], //乐游
    'shss' =>  [4309,43043,2300], //生活时尚
    'dmxc' =>  [4309,43045,2300], //动漫秀场
    'dsjc' =>  [4309,43085,2300], //都市剧场
    //'xsj' =>  [4309,43082,2300], //新视觉X
    'mlzq' =>  [4309,43083,2300], //魅力足球
    'jbty' =>  [1301,43038,2300], //劲爆体育
    'jbty2' =>  [4309,43084,2300], //劲爆体育2
    'yxfy' =>  [1301,43041,2300], //游戏风云
    //吉林
    'jygw' =>  [1301,22002,2300], //家有购物
    //辽宁
    'jtlc' =>  [1301,21001,2300], //家庭理财
    //河北
    'hbsjgw' => [1301,12001,2300], //河北三佳购物
    'hbjjsh' => [1301,13003,2300], //河北经济生活
    'hbnm' => [1301,13004,2300], //河北农民
    'hbds' => [1301,13005,2300], //河北都市
    'hbysj' => [1301,13006,2300], //河北影视剧
    'hbsekj' => [1301,13007,2300], //河北少儿科教
    'hbgg' => [1301,13008,2300], //河北公共
    'hbzj' => [1301,13002,2300], //河北杂技
    'hbsszn' => [1301,13010,2300], //河北收视指南
    'sjzxwzh' => [1301,13014,2300], //石家庄新闻综合
    'sjzds' => [1301,13013,2300], //石家庄都市
    //'sjzyl' => [1301,13011,2300], //石家庄娱乐
    //'sjzsh' => [1301,13012,2300], //石家庄生活
    'tsxwzh' => [1301,13110,2300], //唐山新闻综合
    'tsshfw' => [1301,13111,2300], //唐山生活服务
    'tsys' => [1301,13112,2300], //唐山影视
    'tsgg' => [1301,13113,2300], //唐山公共
    'hdxwzh' => [1301,13009,2300], //邯郸新闻综合
    //山西
    'ygw' => [1301,43,2300], //山西优购物
    //山东
    'sdjy' => [1301,37001,2300], //山东教育卫视*
    'zhms' => [1301,37002,2300], //中华美食*
    //河南
    'hads' => [1301,41101,2300], //河南都市
    'hams' => [1301,41102,2300], //河南民生
    'hafz' => [1301,41103,2300], //河南法治
    'hadsj' => [1301,41104,2300], //河南电视剧
    'haxw' => [1301,41105,2300], //河南新闻
    'hagg' => [1301,41106,2300], //河南公共
    'haxc' => [1301,41107,2300], //河南乡村
    'haly' => [1301,13001,2300], //河南梨园
    'haxq' => [1301,43065,2300], //河南戏曲
    'hays' => [1301,43066,2300], //河南影视
    //'jczy' => [1301,41108,2300], //河南睛彩中原
    //'haydxq' => [1301,41109,2300], //河南移动戏曲
    //'hagf' => [1301,41110,2300], //河南功夫
    //'hasctx' => [1301,41111,2300], //河南收藏天下
    'zzxwzh' => [1301,41112,2300], //郑州新闻综合
    'zkxwzh' => [1301,41113,2300], //周口新闻综合0,1,2,3,4,5
    'kfxwzh' => [1301,41114,2300], //开封新闻综合
    'lyxwzh' => [1301,41115,2300], //洛阳新闻综合
    'pdsxwzh' => [1301,41116,2300], //平顶山新闻综合
    'ayxwzh' => [1301,41117,2300], //安阳新闻综合
    'hbxwzh' => [1301,41118,2300], //鹤壁新闻综合
    'xxxwzh' => [1301,41119,2300], //新乡新闻综合
    'jzxwzh' => [1301,41120,2300], //焦作新闻综合
    'pyxwzh' => [1301,41121,2300], //濮阳新闻综合
    'xczh' => [1301,41122,2300], //许昌综合
    'lhxwzh' => [1301,41123,2300], //漯河新闻综合
    'smxxwzh' => [1301,41124,2300], //三门峡新闻综合
    'sqxwzh' => [1301,41125,2300], //商丘新闻综合
    'zmdxwzh' => [1301,41126,2300], //驻马店新闻综合
    'nyxwzh' => [1301,41127,2300], //南阳新闻综合
    'xyxwzh' => [1301,41128,2300], //信阳新闻综合
    'jytv1' => [1301,41129,2300], //济源1套
    'cclzh' => [1301,41130,2300], //长城铝综合
    'zrtv' => [1301,41136,2300], //郑铁TV
    'rmtd' => [1301,41137,2300], //人民铁道
    //湖南
    'hnjs' => [4309,43024,2300], //湖南经视
    'hnaw' => [4309,43080,2300], //湖南爱晚
    'hnyl' => [4309,43027,2300], //湖南娱乐
    'hnds' => [4309,43028,2300], //湖南都市
    'hnds2' => [4309,43094,2300], //湖南都市2
    'hndy' => [4309,43029,2300], //湖南电影
    'hndy2' => [4309,43098,1300], //湖南电影2
    'hndsj' => [4309,43030,2300], //湖南电视剧
    'hnklg' => [4403,43032,1300], //湖南快乐购
    'jyjs' => [4309,43087,2300], //金鹰纪实
    'jykt' => [4309,81,1300], //金鹰卡通
    'jykt2' => [4309,43025,2300], //金鹰卡通2
    'hnetv' => [4309,43021,2300], //湖南教育电视台
    'yyxwzh' => [4309,43088,1300], //益阳新闻综合
    'yyjy' => [4309,43089,1300], //益阳教育
    'yygg' => [4309,43090,1300], //益阳公共
    //江苏
    'ymkt' => [4403,53,1300], //优漫卡通
    //广东
    'gdzj' => [4403,65,1300], //广东珠江
    'gdms' => [4403,45,1300], //广东民生
    'gdty' => [4403,34,2300], //广东体育
    'gdse' => [4403,63,1300], //广东少儿
    'jjkt' => [1301,41133,2300], //嘉佳卡通
    'szds' => [4403,46,1300], //深圳都市
    'szdsj' => [4403,47,1300], //深圳电视剧
    'szcjsh' => [4403,48,1300], //深圳财经生活
    'szyl' => [4403,49,1300], //深圳娱乐
    'sztyjk' => [4403,50,1300], //深圳体育健康
    'szse' => [4403,51,1300], //深圳少儿
    'szgg' => [4403,52,1300], //深圳公共
    'yhgw' => [4403,42,1300], //深圳宜和购物
    'sktv' => [4403,37,1300], //蛇口电视台
    //香港
    'fhzw' => [1301,52003,2300], //凤凰中文
    'fhzx' => [1301,52002,2300], //凤凰资讯
    ];
$py = rand(0, 5); // 自动判断有效值

$timestamp = intval((time() - 180) / 6 + 0);
$d = date("His",$timestamp*6)+$py;
$stream = "http://{$n[$id][0]}-txt.otvstream.otvcloud.com/otv/skcc/review/channel{$n[$id][1]}/{$n[$id][2]}/";
$url = $stream . date("Ymd",time()-180) . "/" . date("Ymd",time()-180) . "T" . $d . ".ts?starttime=" . date("Ymd",time()-180) . "T" . date("His",$timestamp*6+$py-10) ; // 自动判断有效值
$response = get_headers($url, 1);
if ($response && strpos($response[0], '200') !== false) {
        $py = $d-date("His",$timestamp*6);
        $cache_file = 'py.ini';
        $cache_time = 3600; // 1小时
        file_put_contents($cache_file, $py);
} else {
        $py = ($py + 1) % 6;
    }    
$p = file_get_contents('py.ini');    
$current = "#EXTM3U" . PHP_EOL;
$current .= "#EXT-X-VERSION:3" . PHP_EOL;
$current .= "#EXT-X-TARGETDURATION:6" . PHP_EOL;
$current .= "#EXT-X-MEDIA-SEQUENCE:{$timestamp}" . PHP_EOL;
for ($i = 0; $i < 5; $i++) {
    $current .= "#EXTINF:6.000000," . PHP_EOL;
    $current .= $stream . date("Ymd",time()-180) . "/" . date("Ymd",time()-180) . "T" . date("His",$timestamp*6+$p) . ".ts?starttime=" . date("Ymd",time()-180) . "T" . date("His",$timestamp*6+$p-10) . PHP_EOL;
        $timestamp = $timestamp + 1;
}

header("Content-Type: application/vnd.apple.mpegurl");
header("Content-Disposition: inline; filename=index.m3u8");
echo $current;
?>
